tap "alexdouze/tap"
tap "cormacrelf/tap"
tap "homebrew/bundle"
tap "oven-sh/bun"
tap "redpanda-data/tap"
# Search tool like grep, but optimized for programmers
brew "ack"
# Platform built on V8 to build network applications
brew "node"
# Writes your git commit messages for you with AI
brew "aicommits"
# Mozilla CA bundle for Python
brew "certifi"
# Cryptographic recipes and primitives for Python
brew "cryptography"
# Automate deployment, configuration, and upgrading
brew "ansible"
# GitOps Continuous Delivery for Kubernetes
brew "argocd"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Per-project, per-directory shell environments
brew "autoenv"
# Securely store and access AWS credentials in development environments
brew "aws-vault"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# CLI to install, manage & troubleshoot Kubernetes clusters running Cilium
brew "cilium-cli"
# Home for the Cluster Management API work, a subproject of sig-cluster-lifecycle
brew "clusterctl"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Build control planes without needing to write code
brew "crossplane"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Isolated development environments using Docker
brew "docker-compose"
# Programming language for highly scalable real-time systems
brew "erlang"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Small git utilities
brew "git-extras"
# Git extension for versioning large files
brew "git-lfs"
# Update multiple git repositories at once
brew "gitup"
# Core application library for C
brew "glib"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Deliver Go binaries as fast and easily as possible
brew "goreleaser"
# GNU grep, egrep and fgrep
brew "grep"
# Like cURL, but for gRPC
brew "grpcurl"
# Kubernetes package manager
brew "helm"
# Tool for automatically generating markdown documentation for helm charts
brew "helm-docs"
# Command-line tools for OpenPGP-related operations
brew "hopenpgp-tools"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Add GitHub support to git on the command-line
brew "hub"
# Network, Service & Security Observability for Kubernetes using eBPF
brew "hubble"
# Configurable static site generator
brew "hugo"
# Calculate various network masks, etc. from a given IP address
brew "ipcalc"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Super fast CLI tool to decode and encode JWTs built in Rust
brew "jwt-cli"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Network authentication protocol
brew "krb5"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Package manager for kubectl plugins
brew "krew"
# Kubernetes object analysis recommendations for improved reliability and security
brew "kube-score"
# SDK for building Kubernetes APIs using CRDs
brew "kubebuilder"
# Kubernetes controller and tool for one-way encrypted Secrets
brew "kubeseal"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Lazier way to manage everything docker
brew "lazydocker"
# Utility for directing compilation
brew "make"
# Run a Kubernetes cluster locally
brew "minikube"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Manage multiple NodeJS versions
brew "nodenv"
# Drop-in replacement for Terraform. Infrastructure as Code Tool
brew "opentofu"
# SDK for building Kubernetes applications
brew "operator-sdk"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Fast, disk space efficient package manager
brew "pnpm"
# Object-relational database system
brew "postgresql@15"
# Develop and deploy code with zero configuration
brew "railway"
# Rsync for cloud storage
brew "rclone"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Rancher Kubernetes Engine, a Kubernetes installer that works everywhere
brew "rke"
# Rust toolchain installer
brew "rustup"
# SOcket CAT: netcat on steroids
brew "socat"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# User interface to the TELNET protocol
brew "telnet"
# Tool to generate documentation from Terraform modules
brew "terraform-docs"
# Text interface for Git repositories
brew "tig"
# Define your dev environment as code. For microservice apps on Kubernetes
brew "tilt"
# Lightweight BitTorrent client
brew "transmission-cli"
# Creates fully functional virtual k8s cluster inside host k8s cluster's namespace
brew "vcluster"
# Modern watch command
brew "viddy"
# Tool for creating isolated virtual python environments
brew "virtualenv"
# Python virtualenv extensions
brew "virtualenvwrapper"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Network analyzer and capture tool - without graphical user interface
brew "wireshark"
# JavaScript package manager
brew "yarn"
# Tool for managing your YubiKey configuration
brew "ykman"
# YubiKey personalization library and tool
brew "ykpers"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Command-line tool for the YubiKey PIV application
brew "yubico-piv-tool"
# Feature-rich syntax highlighting for Zsh
brew "zsh-fast-syntax-highlighting"
# Zsh port of Fish shell's history search
brew "zsh-history-substring-search"
# ZSH plugin that reminds you to use existing aliases for commands you just typed
brew "zsh-you-should-use"
# Git Manager CLI tool
brew "alexdouze/tap/gitm"
# The k3kcli provides a quick and easy way to create K3k clusters and automatically exposes them via a kubeconfig.
brew "alexdouze/tap/k3kcli"
# Watcher for macOS 10.14+ light/dark mode changes
brew "cormacrelf/tap/dark-notify"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# Redpanda CLI & toolbox
brew "redpanda-data/tap/redpanda"
# Password manager that keeps all passwords secure behind one password
cask "1password", greedy: true
# Command-line interface for 1Password
cask "1password-cli", greedy: true
# Stand alone ad blocker
cask "adguard", greedy: true
# Apple TV Aerial screensaver
cask "aerial@beta", greedy: true
# Application launcher and productivity software
cask "alfred", greedy: true
# Allows connection to a computer remotely
cask "anydesk", greedy: true
# Chromium based browser
cask "arc", greedy: true
# Menu bar icon organiser
cask "bartender", greedy: true
# Open source IDE for exploring and testing APIs
cask "bruno", greedy: true
# Code snippet manager
cask "codespace", greedy: true
# Multi-platform client-side cloud file encryption tool
cask "cryptomator", greedy: true
# Disk space visualiser
cask "daisydisk", greedy: true
# Voice and text chat software
cask "discord", greedy: true
# Launcher for *Epic Games* games
cask "epic-games", greedy: true
# Web browser
cask "firefox", greedy: true
cask "font-jetbrains-mono-nerd-font", greedy: true
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk", greedy: true
# Testing client for REST, GraphQL, and HTTP APIs
cask "httpie", greedy: true
# System monitoring app
cask "istat-menus", greedy: true
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2", greedy: true
# Enable generative AI features in iTerm2
cask "itermai", greedy: true
# Keyboard customiser
cask "karabiner-elements", greedy: true
# Provides updates to various Microsoft products
cask "microsoft-auto-update", greedy: true
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams", greedy: true
# Sandbox construction video game
cask "minecraft", greedy: true
# Tool to control external monitor brightness & volume
cask "monitorcontrol", greedy: true
# Replacement for Docker Desktop
cask "orbstack", greedy: true
# Administration and development platform for PostgreSQL
cask "pgadmin4", greedy: true
# Collaboration platform for API development
cask "postman", greedy: true
# VPN client focusing on security
cask "protonvpn", greedy: true
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle", greedy: true
# Automatically checks computer's security
cask "silentknight", greedy: true
# Team communication and collaboration software
cask "slack", greedy: true
# Music streaming service
cask "spotify", greedy: true
# Video game digital distribution service
cask "steam", greedy: true
# Quicklook extension for source files
cask "syntax-highlight", greedy: true
# Mesh VPN based on WireGuard
cask "tailscale", greedy: true
# Open-source BitTorrent client
cask "transmission", greedy: true
# OpenVPN client with AppleScript support
cask "viscosity", greedy: true
# Open-source code editor
cask "visual-studio-code", greedy: true
# Native desktop client for WhatsApp
cask "whatsapp", greedy: true
# Network protocol analyzer
cask "wireshark", greedy: true
# X Certificate and Key management
cask "xca", greedy: true
# Video communication and virtual meeting platform
cask "zoom", greedy: true
vscode "aaron-bond.better-comments"
vscode "adamhartford.vscode-base64"
vscode "alefragnani.project-manager"
vscode "bierner.color-info"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.path-intellisense"
vscode "csstools.postcss"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "flesler.url-encode"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "hediet.vscode-drawio"
vscode "hilleer.yaml-plus-json"
vscode "jakebecker.elixir-ls"
vscode "janisdd.vscode-edit-csv"
vscode "jflbr.jwt-decoder"
vscode "jlcs-es.x509-parser"
vscode "jq-syntax-highlighting.jq-syntax-highlighting"
vscode "lukepearson.cidr-ip-range"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "ms-vsliveshare.vsliveshare"
vscode "oderwat.indent-rainbow"
vscode "pascalreitermann93.vscode-yaml-sort"
vscode "pflannery.vscode-versionlens"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "saoudrizwan.claude-dev"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "tilt-dev.tiltfile"
vscode "tim-koehler.helm-intellisense"
vscode "upboundio.upbound"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vivaxy.vscode-conventional-commits"
vscode "vscode-icons-team.vscode-icons"
vscode "yzhang.markdown-all-in-one"
