tap "cormacrelf/tap"
tap "homebrew/bundle"
tap "norwoodj/tap"
tap "oven-sh/bun"
# Search tool like grep, but optimized for programmers
brew "ack"
# Writes your git commit messages for you with AI
brew "aicommits"
# Automate deployment, configuration, and upgrading
brew "ansible"
# GitOps Continuous Delivery for Kubernetes
brew "argocd"
# Per-project, per-directory shell environments
brew "autoenv"
# Securely store and access AWS credentials in development environments
brew "aws-vault"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# CLI to install, manage & troubleshoot Kubernetes clusters running Cilium
brew "cilium-cli"
# Home for the Cluster Management API work, a subproject of sig-cluster-lifecycle
brew "clusterctl"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Isolated development environments using Docker
brew "docker-compose"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Small git utilities
brew "git-extras"
# Git extension for versioning large files
brew "git-lfs"
# Update multiple git repositories at once
brew "gitup"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Deliver Go binaries as fast and easily as possible
brew "goreleaser"
# Kubernetes package manager
brew "helm"
# Command-line tools for OpenPGP-related operations
brew "hopenpgp-tools"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Add GitHub support to git on the command-line
brew "hub"
# Network, Service & Security Observability for Kubernetes using eBPF
brew "hubble"
# Configurable static site generator
brew "hugo"
# Calculate various network masks, etc. from a given IP address
brew "ipcalc"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Network authentication protocol
brew "krb5"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Package manager for kubectl plugins
brew "krew"
# Kubernetes object analysis recommendations for improved reliability and security
brew "kube-score"
# Kubernetes controller and tool for one-way encrypted Secrets
brew "kubeseal"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Lazier way to manage everything docker
brew "lazydocker"
# Utility for directing compilation
brew "make"
# Run a Kubernetes cluster locally
brew "minikube"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Manage multiple NodeJS versions
brew "nodenv"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Object-relational database system
brew "postgresql@15"
# Rsync for cloud storage
brew "rclone"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Rancher Kubernetes Engine, a Kubernetes installer that works everywhere
brew "rke"
# Rust toolchain installer
brew "rustup-init"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# User interface to the TELNET protocol
brew "telnet"
# Graphical network analyzer and capture tool
brew "wireshark", link: false
# Terminal UI for tshark, inspired by Wireshark
brew "termshark"
# Tool to generate documentation from Terraform modules
brew "terraform-docs"
# Text interface for Git repositories
brew "tig"
# Lightweight BitTorrent client
brew "transmission-cli"
# Creates fully functional virtual k8s cluster inside host k8s cluster's namespace
brew "vcluster"
# Modern watch command
brew "viddy"
# Tool for creating isolated virtual python environments
brew "virtualenv"
# Python virtualenv extensions
brew "virtualenvwrapper"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Tool for managing your YubiKey configuration
brew "ykman"
# YubiKey personalization library and tool
brew "ykpers"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Command-line tool for the YubiKey PIV application
brew "yubico-piv-tool"
# Feature-rich syntax highlighting for Zsh
brew "zsh-fast-syntax-highlighting"
# Zsh port of Fish shell's history search
brew "zsh-history-substring-search"
# ZSH plugin that reminds you to use existing aliases for commands you just typed
brew "zsh-you-should-use"
# Watcher for macOS 10.14+ light/dark mode changes
brew "cormacrelf/tap/dark-notify"
# Automatically generate markdown documentation for helm charts
brew "norwoodj/tap/helm-docs"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# Password manager that keeps all passwords secure behind one password
cask "1password", greedy: true
# Command-line interface for 1Password
cask "1password-cli", greedy: true
# Stand alone ad blocker
cask "adguard", greedy: true
# Apple TV Aerial screensaver
cask "aerial-beta", greedy: true
# Application launcher and productivity software
cask "alfred", greedy: true
# Chromium based browser
cask "arc", greedy: true
# Menu bar icon organizer
cask "bartender", greedy: true
# Code snippet manager
cask "codespace", greedy: true
# Multi-platform client-side cloud file encryption tool
cask "cryptomator", greedy: true
# Disk space visualizer
cask "daisydisk", greedy: true
# Voice and text chat software
cask "discord", greedy: true
# Application window manager focusing on simplicity
cask "divvy", greedy: true
# Launcher for *Epic Games* games
cask "epic-games", greedy: true
# Web browser
cask "firefox", greedy: true
# Free monospaced font with programming ligatures
cask "font-fira-code", greedy: true
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font", greedy: true
# Free and open-source image editor
cask "gimp", greedy: true
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk", greedy: true
# Testing client for REST, GraphQL, and HTTP APIs
cask "httpie", greedy: true
# System monitoring app
cask "istat-menus", greedy: true
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2-beta", greedy: true
# Keyboard customizer
cask "karabiner-elements", greedy: true
# Provides updates to various Microsoft products
cask "microsoft-auto-update", greedy: true
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams", greedy: true
# Tool to control external monitor brightness & volume
cask "monitorcontrol", greedy: true
# Replacement for Docker Desktop
cask "orbstack", greedy: true
# VPN client focusing on security
cask "protonvpn", greedy: true
# Remote management solution
cask "royal-tsx-beta", greedy: true
# Automatically checks computer's security
cask "silentknight", greedy: true
# Team communication and collaboration software
cask "slack", greedy: true
# Music streaming service
cask "spotify", greedy: true
# Video game digital distribution service
cask "steam", greedy: true
# Quicklook extension for source files
cask "syntax-highlight"
# Mesh VPN based on Wireguard
cask "tailscale", greedy: true
# Open-source BitTorrent client
cask "transmission", greedy: true
# OpenVPN client with AppleScript support
cask "viscosity", greedy: true
# Open-source code editor
cask "visual-studio-code", greedy: true
# Network protocol analyzer
cask "wireshark", greedy: true
# X Certificate and Key management
cask "xca", greedy: true
# Application for configuring any YubiKey
cask "yubico-yubikey-manager"
# Video communication and virtual meeting platform
cask "zoom", greedy: true
vscode "aaron-bond.better-comments"
vscode "adamhartford.vscode-base64"
vscode "alefragnani.project-manager"
vscode "bierner.color-info"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.path-intellisense"
vscode "csstools.postcss"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "flesler.url-encode"
vscode "FrancescoBoffa.rfc-reader"
vscode "GitHub.codespaces"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "github.vscode-github-actions"
vscode "GitHub.vscode-pull-request-github"
vscode "golang.go"
vscode "Gruntfuggly.todo-tree"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "hediet.vscode-drawio"
vscode "JakeBecker.elixir-ls"
vscode "janisdd.vscode-edit-csv"
vscode "jlcs-es.x509-parser"
vscode "lukepearson.cidr-ip-range"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.autopep8"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vsliveshare.vsliveshare"
vscode "oderwat.indent-rainbow"
vscode "pflannery.vscode-versionlens"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "streetsidesoftware.code-spell-checker"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "Tim-Koehler.helm-intellisense"
vscode "upboundio.upbound"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vivaxy.vscode-conventional-commits"
vscode "vscode-icons-team.vscode-icons"
vscode "yzhang.markdown-all-in-one"
vscode "davidnussio.vscode-jq-playground"
vscode "jq-syntax-highlighting.jq-syntax-highlighting"
